app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "dfdsdf"], ["post_id", 1], ["created_at", "2016-06-02 16:12:02.834896"], ["updated_at", "2016-06-02 16:12:02.834896"]]
---
<li id="comment_<%= comment.id %>">
	<%= comment.body %>,
	<%= time_ago_in_words(comment.created_at) %> ago