app/views/posts/post_types/_blog.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
    <div class='post'>
      <td><%= post.title %> <small>( <%= post.comments.size %> )</small></td>