app/views/posts/post_types/_bulletin.html.erb

		<tr>
			<td><%= post.title %> <small>( <%= post.comments.size %> )</small></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]