app/views/posts/post_types/_gallery.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]
---
		<div class='title'>
			<%= post.title %> <small>( <%= post.comments.size %> )</small>