app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.new(comment_params)
    @comment.save()
---
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "comment1"], ["post_id", 1], ["created_at", "2016-06-02 15:59:42.419193"], ["updated_at", "2016-06-02 15:59:42.419193"]]

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def set_comment
    @comment = @post.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 63]]