app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" JOIN taggings posts_taggings_18e40e1  ON posts_taggings_18e40e1.taggable_id = posts.id AND posts_taggings_18e40e1.taggable_type = 'Post' AND posts_taggings_18e40e1.tag_id = 4
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('ruby'))
---
  def index
    if params[:bulletin_id]
      @posts = @bulletin.posts.all
    else
      if params[:tag]
        @posts = Post.tagged_with(params[:tag])
      else
        @posts = Post.all

INSERT INTO "posts" ("title", "content", "bulletin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "df"], ["content", "dfdfd"], ["bulletin_id", 2], ["created_at", "2016-06-01 10:24:57.017692"], ["updated_at", "2016-06-01 10:24:57.017692"]]
---
  def create
    @post = @bulletin.posts.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "picture" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["picture", "learnrubyonrails-sample.pdf"], ["updated_at", "2016-06-01 18:07:55.058210"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_bulletin
      @bulletin = Bulletin.find(params[:bulletin_id]) if params[:bulletin_id]

SELECT  "posts".* FROM "posts" WHERE "posts"."bulletin_id" = ? AND "posts"."id" = ? LIMIT 1  [["bulletin_id", 2], ["id", 5]]
---
    def set_post
      if params[:bulletin_id]
        @post = @bulletin.posts.find(params[:id])